workspace/DataProcessors/АукРабочийСтолАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>АукРабочийСтолАукционы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

workspace/InformationRegisters/АукИсторияДанныхАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИсторияДанныхАукционов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеЭлементаДанных</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаправлениеДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукНаправленияДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукВидыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементДанных</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/Catalogs/АукАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукАукционы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАукциона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийАукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийСтарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНачальныхДанных</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНачальныхДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНачальныхДанных</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/DataProcessors/АукРабочийСтолАукционы/Forms/ПросмотрИсторииСтавок2/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////
// Условное оформление задано программно,
// даже то что можно было бы задать через настройки формы
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Обработка_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.Обработка_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Обработка_ПриОткрытии(ЭтотОбъект, Отказ);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПодпискиНаСобытияФормКлиент.Обработка_ПослеОткрытия(ЭтотОбъект, Отказ);			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКоманд

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачальнаяИнициализация()
	
	ЭтотОбъект.Аукцион		= Параметры.Аукцион;
	ЭтотОбъект.ВидАукциона	= Параметры.ВидАукциона;
	
	//АукОбщийСервер.ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(ЭтотОбъект, Параметры.ВидАукциона, "тзИсторияСтавок",,, Ложь); 
	
	АукОбщийСервер.ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(ЭтотОбъект, Параметры.ВидАукциона, "дзИсторияСтавок", Элементы.дзИсторияСтавокГруппа3,, Ложь);
	
	ЗаполнитьИсториюСтавок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюСтавок()
		
	//тзВсеСтавки = РегистрыСведений.АукИсторияДанныхАукционов.ПолнаяИсторияСтавокУчастниковАукционаВСтроке(Параметры.Аукцион, Параметры.ВидАукциона);
	//
	//тзТемп = РеквизитФормыВЗначение("тзИсторияСтавок");
	//
	//Для Каждого СтрокаТз Из тзВсеСтавки Цикл
	//	
	//	НовСтрока = тзТемп.Добавить();
	//	
	//	ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТз);
	//	
	//КонецЦикла;
	//
	//ЗначениеВРеквизитФормы(тзТемп, "тзИсторияСтавок");
	
	///////////////////
	масЭтапыАукциона = Справочники.АукАукционы.ЭтапыАукциона(Параметры.Аукцион);
	
	тзВсеСтавки1 = РегистрыСведений.АукИсторияДанныхАукционов.ПолнаяИсторияСтавокУчастниковАукционаПоЭтапамВСтроке(Параметры.Аукцион, Параметры.ВидАукциона);
	
	дзТемп = РеквизитФормыВЗначение("дзИсторияСтавок");
	
	Для Каждого сткЭлЭтап Из масЭтапыАукциона Цикл
		
		масСтрокиТз = тзВсеСтавки1.НайтиСтроки(Новый Структура("Этап", сткЭлЭтап.Этап));
		
		Если масСтрокиТз.Количество() <> 0 Тогда
			
			НовСтрокаГр1 = дзТемп.Строки.Добавить();
			
			НовСтрокаГр1.Этап = сткЭлЭтап.Этап;
			
			Для Каждого СтрокаТз Из масСтрокиТз Цикл
				
				ЗаполнитьЗначенияСвойств(НовСтрокаГр1.Строки.Добавить(), СтрокаТз);
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;	
		
	ЗначениеВРеквизитФормы(дзТемп, "дзИсторияСтавок");
	
	/////////////////// УО	
	масПоля = АукОбщийСервер.СписокПодчиненныхПолейВводаЭлементаФормы(Элементы.дзИсторияСтавокГруппа1);
	
	УсловноеОформление.Элементы.Очистить(); 
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Истина));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "Заполнено");
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, СтрСоединить(масПоля, ", "));
		
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Ложь));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "НеЗаполнено");
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, СтрСоединить(масПоля, ", "));
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Ложь));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "Заполнено");			
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, "дзИсторияСтавокЭтап");
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("Видимость", Истина));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "НеЗаполнено");			
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, "дзИсторияСтавокЭтап");
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОбщегоНазначения.УстановитьЗначенияПараметровУсловногоОформления(ЭлементОформления, Новый Структура("ЦветФона", WebЦвета.ХакиТемный));	
	ОбщегоНазначения.ДобавитьЭлементОтбораУсловногоОформления(ЭлементОформления, "дзИсторияСтавок.Период", "НеЗаполнено");			
	ОбщегоНазначения.ДобавитьПолеУсловногоОформления(ЭлементОформления, "дзИсторияСтавокЭтап");
	
	
КонецПроцедуры

#КонецОбласти
